In [1]:
#Data Manip
import pandas as pd 

#Plotting
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import style

#Math / Stats
import numpy as np
from scipy import stats


import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [31]:
data = pd.read_csv('Exercise Data - Accounts.csv')
df_accounts = pd.DataFrame(data)

df_accounts.head()
df_accounts.shape

        ID Date Created Primary Customer ID
0  1433067    7/29/2016        1433067-1837
1  5239568    1/31/2016        5239568-3438
2  8792113    8/12/2015        8792113-2129
3  9933022     6/9/2015        9933022-2156
4  5983637    9/26/2015        5983637-2118

(99, 3)

In [40]:
#Load in our Transaction data

data3 = pd.read_csv('Exercise Data - Transaction.csv')
df_trans = pd.DataFrame(data3)

df_trans.head(3)
df_trans.shape

,Transaction ID,Timestamp,Customer_id,Price,Payment Type,Store_ID,Product_id
0,UA1612564,8/1/18 21:48,9613826-4631,$ 10.44,cash,8,hv14611
1,ND5716734,7/22/18 8:46,8232366-2237,$ 17.38,credit,15,pr44026
2,CL1777910,8/3/18 12:17,6446994-1900,$ 23.62,cash,2,hv6190

(1997, 7)

In [32]:
#Load in our Loyalty data

data1 = pd.read_csv('Exercise Data - Loyalty Customers.csv')
df_loyalty1 = pd.DataFrame(data1)
df_loyalty = df_loyalty1.drop(['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], axis=1)

df_loyalty.head(3)
df_loyalty.shape

        ID Loyalty_status
0  6935710         Silver
1  6315100           Gold
2  5393503           Gold

(90, 2)

In [33]:
#Load in our Customer data

data = pd.read_csv('Exercise Data - Customers.csv')
df_customers = pd.DataFrame(data)


df_customers.head()
df_customers.shape

             ID  Age State Last Active
0  1433067-1837   57    CA   4/17/2018
1  5239568-3438   24    NY    9/3/2017
2  8792113-2129   44    FL   9/18/2017
3  9933022-2156   29    CA   4/15/2018
4  5983637-2118   37    NY   3/20/2018

(169, 4)

In [39]:
#Load in our Product data

data2 = pd.read_csv('Exercise Data - Products.csv')
df_products = pd.DataFrame(data2)

df_products.head(3)

df_products.shape

  Product_ID           Name                               Description
0    pr40885    Macroset TV    High-heeled, Pringle-cased Macroset TV
1    pr11020  Burbret Chair   Whacky handle, Immaculate Burbret Chair
2    hv46425     Astin Bike  Purple spotted, Caffeine-free Astin Bike

(40, 3)

In [34]:
df_customers['account_id'] = df_customers['ID'].apply(lambda x: x[0:7])
df_customers.head()

             ID  Age State Last Active account_id
0  1433067-1837   57    CA   4/17/2018    1433067
1  5239568-3438   24    NY    9/3/2017    5239568
2  8792113-2129   44    FL   9/18/2017    8792113
3  9933022-2156   29    CA   4/15/2018    9933022
4  5983637-2118   37    NY   3/20/2018    5983637

In [35]:
print(df_customers.dtypes)

df_customers['account_id'] = df_customers['account_id'].astype(int)

print(df_customers.dtypes)

#ID in df_accounts is an int so to merge the two columns they need to be the same type

ID             object
Age             int64
State          object
Last Active    object
account_id     object
dtype: object
ID             object
Age             int64
State          object
Last Active    object
account_id      int64
dtype: object

In [36]:
df = pd.merge(df_customers, df_accounts, left_on=['account_id'], right_on=['ID'])

print(df.shape)
df.head()

(169, 8)

,ID_x,Age,State,Last Active,account_id,ID_y,Date Created,Primary Customer ID
0,1433067-1837,57,CA,4/17/2018,1433067,1433067,7/29/2016,1433067-1837
1,5239568-3438,24,NY,9/3/2017,5239568,5239568,1/31/2016,5239568-3438
2,8792113-2129,44,FL,9/18/2017,8792113,8792113,8/12/2015,8792113-2129
3,9933022-2156,29,CA,4/15/2018,9933022,9933022,6/9/2015,9933022-2156
4,5983637-2118,37,NY,3/20/2018,5983637,5983637,9/26/2015,5983637-2118

In [37]:
#clean up here as we go, removing duplicate columns

df = df.drop(['ID_y'], axis=1)
df.head()

,ID_x,Age,State,Last Active,account_id,Date Created,Primary Customer ID
0,1433067-1837,57,CA,4/17/2018,1433067,7/29/2016,1433067-1837
1,5239568-3438,24,NY,9/3/2017,5239568,1/31/2016,5239568-3438
2,8792113-2129,44,FL,9/18/2017,8792113,8/12/2015,8792113-2129
3,9933022-2156,29,CA,4/15/2018,9933022,6/9/2015,9933022-2156
4,5983637-2118,37,NY,3/20/2018,5983637,9/26/2015,5983637-2118

In [38]:
#So here we should have data from our account file, customer file, and loyalty file

df = pd.merge(df, df_loyalty, left_on=['account_id'], right_on=['ID'])
df.head()
df.shape

,ID_x,Age,State,Last Active,account_id,Date Created,Primary Customer ID,ID,Loyalty_status
0,1433067-1837,57,CA,4/17/2018,1433067,7/29/2016,1433067-1837,1433067,Gold
1,5239568-3438,24,NY,9/3/2017,5239568,1/31/2016,5239568-3438,5239568,Platinum
2,5239568-3438,24,NY,9/3/2017,5239568,1/31/2016,5239568-3438,5239568,Silver
3,8792113-2129,44,FL,9/18/2017,8792113,8/12/2015,8792113-2129,8792113,Platinum
4,9933022-2156,29,CA,4/15/2018,9933022,6/9/2015,9933022-2156,9933022,Platinum

(143, 9)

In [41]:
#Drop another redundant column

df = df.drop(['account_id'], axis=1)
df.head()

,ID_x,Age,State,Last Active,Date Created,Primary Customer ID,ID,Loyalty_status
0,1433067-1837,57,CA,4/17/2018,7/29/2016,1433067-1837,1433067,Gold
1,5239568-3438,24,NY,9/3/2017,1/31/2016,5239568-3438,5239568,Platinum
2,5239568-3438,24,NY,9/3/2017,1/31/2016,5239568-3438,5239568,Silver
3,8792113-2129,44,FL,9/18/2017,8/12/2015,8792113-2129,8792113,Platinum
4,9933022-2156,29,CA,4/15/2018,6/9/2015,9933022-2156,9933022,Platinum

In [42]:
#Let's drop duplicates here as well..

df = df.drop_duplicates()
df = df.reset_index(drop=True)
df.shape

(120, 8)

In [45]:
#We can make a new dataframe featuring only our Platinum customers if desired

df_plat = df[df['Loyalty_status'] == 'Platinum']
df_plat = df_plat.reset_index(drop=True)

df_plat.head()
df_plat.shape

,ID_x,Age,State,Last Active,Date Created,Primary Customer ID,ID,Loyalty_status
0,5239568-3438,24,NY,9/3/2017,1/31/2016,5239568-3438,5239568,Platinum
1,8792113-2129,44,FL,9/18/2017,8/12/2015,8792113-2129,8792113,Platinum
2,9933022-2156,29,CA,4/15/2018,6/9/2015,9933022-2156,9933022,Platinum
3,1317886-1555,32,FL,6/28/2018,2/15/2016,1317886-1555,1317886,Platinum
4,8904045-1444,22,FL,3/15/2018,6/1/2016,8904045-1444,8904045,Platinum

(49, 8)

### This could be a good starting point, to analyze the association that Age and State have to do with platinum status
Ultimately this is a gut feeling for a starting off point, it seems likely that age could have some sort of correlation with Loyalty status. State could have some form of correlation as well, location could affect things in unforseen ways

Moving forward you could merge things like the product file into the main dataframe and do a categorcial analysis to see if certain products are leading to a high loyalty status. 

All this information would be quite useful for the marketing goals and targets of a specific company.